{
    "label.navbar.home": "Inicio",
    "label.navbar.aboutMe": "Sobre mí",
    "label.navbar.contact": "Contacto",
    "label.navbar.projects": "Proyectos",
    "label.home.title": "Hola, mi nombre es Miguel",
    "label.home.gradient.dev": "Soy {Desarrollador Front-End}",
    "label.home.gradient.opportunity": "Busco una oportunidad",
    "label.home.gradient.welcome": "Bienvenidos a mi portafolio",
    "label.home.download": "Descargar CV ",
    "label.about.section.title.about": "Sobre mí",
    "label.about.section.title.experience": "Experiencia",
    "label.about.section.title.studies": "Estudios",
    "label.about.section.title.courses": "Cursos",
    "label.about.section.title.skills": "Habilidades",
    "label.personal.data.direction": "Pola de Laviana, Asturias, España",
    "label.about.about.title": "Desarrollador Web",
    "label.about.about.bio1": "Soy una persona muy curiosa y apasionada por las nuevas tecnologías. Siempre estoy en búsqueda de aprender y crecer en mi campo. Como desarrollador Front-end, he trabajado con tecnologías como Angular y .Net, lo que me ha permitido enfrentar diversos retos y ampliar mi conocimiento. Soy una persona agradable y comprometida en los entornos laborales; disfruto trabajar en equipo y aportar ideas creativas que ayuden a alcanzar los objetivos propuestos. Creo firmemente que el trabajo en equipo es fundamental para lograr el éxito en cualquier proyecto. Siempre estoy dispuesto a escuchar nuevas ideas y puntos de vista, y considero que la comunicación es clave para llevar adelante cualquier proyecto.",
    "label.about.about.bio2": "Tras dedicar varios meses a formarme y especializar mis conocimientos, busco la oportunidad de unirme a una empresa. Estoy motivado para contribuir en proyectos ambiciosos, aportando mi energía y mi capacidad para trabajar en equipo.",
    "label.about.studies.school.uniovi": "Universidad de Oviedo",
    "label.about.studies.school.uniovi.title": "Ingeniería Informática en Tecnologías de la Información",
    "label.about.studies.school.uniovi.range": "09/2016 a 07/2018 (Sin finalizar)",
    "label.about.studies.school.jjcm": "IES Juan José Calvo Miguel",
    "label.about.studies.school.jjcm.title": "Desarrollo de Aplicaciones Multiplataforma",
    "label.about.studies.school.jjcm.range": "09/2018 a 06/2020",
    "label.about.studies.school.afa": "Afa Formación",
    "label.about.studies.school.afa.title": "Desarrollo de Aplicaciones con Tecnologías Web",
    "label.about.studies.school.afa.range": "06/2024 a actualidad",
    "label.about.studies.school.cifp": "CIFP Avilés",
    "label.about.studies.school.cifp.title": "Desarrollo de Aplicaciones Web",
    "label.about.studies.school.cifp.range": "09/2024 a actualidad",
    "label.about.courses.title.full.stack": "Full Stack con React y Node.js",
    "label.about.courses.title.angular.spring.boot": "Desarrollo frontend con Angular 17 y backend Spring Boot 3",
    "label.about.courses.title.api.rest.php": "API REST con PHP y MYSQL",
    "label.about.courses.title.angular-aspnet": "Desarrollando Aplicaciones en Angular 12 y ASP.NET Core 5",
    "label.about.courses.title.angularjs": "Curso de AngularJS",
    "label.about.courses.title.net": "Curso completo programación C# en .Net",
    "label.about.courses.title.test-unit": "Angular: Pruebas unitarias con Jasmine y Karma",
    "label.about.courses.title.marketing": "Conceptos básicos Marketing Digital",
    "label.about.courses.title.unity": "Desarrollo de Videojuegos 2D en Unity 3D 5",
    "label.about.courses.title.angular8": "Angular 8+ con 10 proyectos completo",
    "label.about.courses.title.security": "Máster en Seguridad Informática. De 0 a Experto",
    "label.about.courses.title.hacking": "Hacking Ético desde Cero",
    "label.about.courses.title.python": "Máster en Python 3.x. Aprende de 0 a EXPERTO con Práctica",
    "label.about.experiences.clarcat.range": "10/2020 a 01/2023",
    "label.about.experiences.hybrid": "Hibrido",
    "label.about.experiences.read.more": "Ver más",
    "label.about.experiences.front.end.programmer": "Desarrollador Front-End",
    "label.about.experiences.clarcat.task": "Durante mi empleo en Clarcat, tuve el privilegio de formar parte de un gran proyecto como Desarrollador Front-End. Mi principal responsabilidad consistía en el desarrollo de las pantallas en Angular, trabajando inicialmente con la versión 7 y posteriormente migrando a Angular 13. Durante este proceso, utilicé bibliotecas como Angular Material y también implementé bibliotecas personalizadas para cumplir con los requisitos específicos del cliente. También asumí la realización de las pruebas unitarias utilizando Jasmine y Karma.<br>El proyecto se estructuraba en una arquitectura que comprendía una parte front-end desarrollada en Angular, un pequeño back-end del propio Front en .Net y el back-end completo también en .Net. Dentro del back-end del front-end, trabajé con traducciones y llamadas a la API.<br>En el proyecto, seguíamos metodologías Agile y trabajamos en sprints mensuales contralada por la plataforma Azure Devops. Además, utilizamos Git como repositorio de código, facilitando la gestión y el control de versiones del proyecto.",
    "label.skills.data-base": "Base de Datos",
    "label.skills.frameworks": "Frameworks",
    "label.skills.methodology": "Metodologías",
    "label.skills.programming-languages": "Lenguajes",
    "label.skills.style-library": "Bibliotecas de Estilos",
    "label.skills.version-control": "Control de Versiones",
    "label.projects.title": "Proyectos",
    "label.projects.resume.MrRobot": "Mr. Robot es mi primer gran proyecto, desarrollado como parte de mi trabajo de fin de ciclo con el que obtuve un sobresaliente alto. Este emocionante juego de plataformas en 2D con estilo pixel art,  desarrollado en Unity 2019, sigue al personaje principal que debe alcanzar un enchufe en cada nivel. Para lograrlo, recolecta piezas y baterías para mantener su energía mientras enfrenta desafíos de dificultad variada.",
    "label.projects.resume.filmatick": "FilmaticK es un proyecto en desarrollo que he dedicado mucho tiempo para apoyar mi formación. Desarrollado en Angular y .Net, es un proyecto Fullstack ambicioso. La plataforma se presenta como una enciclopedia cinematográfica donde los usuarios pueden llevar un diario de cine, votar películas y crear listas personalizadas.",
    "label.projects.resume.puzzle": "Angular Puzzle es un rompecabezas estilo jigsaw desarrollado en Angular. Lo creé inicialmente como parte de un regalo, pero se convirtió en un desafío personal. Decidí desplegarlo y pulirlo aún más después de darme cuenta de la escasez de ejemplos similares en Internet. Esta singularidad me motivó a crear una elegante y hermosa web dedicada al juego.",
    "label.projects.resume.weatherTS": "WeatherTS es una aplicación web dinámica y moderna, diseñada para ofrecer pronósticos meteorológicos precisos y actualizados. Desarrollada con Angular 17, esta aplicación se alimenta de una API robusta para proporcionar información detallada del tiempo. Los usuarios pueden acceder al pronóstico actual, así como a las previsiones para los próximos cinco días y las próximas 24 horas, junto con los datos más relevantes del día.",
    "label.projects.resume.shopping.cart": "Shopping Cart es una aplicación web básica y funcional, creada como mi primer proyecto utilizando React y la librería de estilos Tailwind. Esta sencilla aplicación permite a los usuarios añadir productos a su carrito de compras a través de un formulario intuitivo. Desarrollada como una prueba de concepto, Shopping Cart destaca por su diseño limpio y su interfaz responsiva, ofreciendo una experiencia de usuario satisfactoria.",
    "label.contact.title": "Contacto",
    "label.contact.name": "Nombre",
    "label.contact.email": "Correo Electrónico",
    "label.contact.company": "Empresa",
    "label.contact.message": "Mensaje",
    "label.contact.button.send": "Enviar Mensaje",
    "label.contact.success": "Correo enviado exitosamente",
    "label.contact.error": "Ha ocurrido un error al enviar el correo",
    "label.contact.description": "Desarrollador Frontend"
}
