{
    "label.navbar.home": "Home",
    "label.navbar.aboutMe": "About Me",
    "label.navbar.contact": "Contact",
    "label.navbar.projects": "Projects",
    "label.home.title": "Hi, my name is Miguel",
    "label.home.gradient.dev": "I am a {Front-End Developer}",
    "label.home.gradient.opportunity": "I am seeking an opportunity",
    "label.home.gradient.welcome": "Welcome to my portfolio",
    "label.home.download": "Download CV ",
    "label.about.section.title.about": "About me",
    "label.about.section.title.experience": "Experience",
    "label.about.section.title.studies": "Studies",
    "label.about.section.title.courses": "Courses",
    "label.about.section.title.skills": "Skills",
    "label.personal.data.direction": "Pola de Laviana, Asturias, Spain",
    "label.about.about.title": "Web Developer",
    "label.about.about.bio1": "I am a very curious person passionate about new technologies. I am always seeking to learn and grow in my field. As a Front-end developer, I have worked with technologies such as Angular and .Net, which has allowed me to face various challenges and expand my knowledge. I am a pleasant and committed person in work environments; I enjoy working in teams and contributing creative ideas that help achieve the proposed objectives. I firmly believe that teamwork is fundamental for success in any project. I am always willing to listen to new ideas and points of view, and I consider communication to be key to moving forward with any project.",
    "label.about.about.bio2": "After dedicating several months to training and specializing my knowledge, I am looking for the opportunity to join a company. I am motivated to contribute to ambitious projects, bringing my energy and my ability to work as part of a team.",
    "label.about.studies.school.uniovi": "University of Oviedo",
    "label.about.studies.school.uniovi.title": "Computer Engineering in Information Technologies",
    "label.about.studies.school.uniovi.range": "09/2016 to 07/2018 (Incomplete)",
    "label.about.studies.school.jjcm": "Juan José Calvo Miguel High School",
    "label.about.studies.school.jjcm.title": "Multiplatform Application Development",
    "label.about.studies.school.jjcm.range": "09/2018 to 06/2020",
    "label.about.studies.school.afa": "Afa Formation",
    "label.about.studies.school.afa.title": "Application Development with Web Technologies",
    "label.about.studies.school.afa.range": "06/2024 to present",
    "label.about.studies.school.cifp": "CIFP Avilés",
    "label.about.studies.school.cifp.title": "Web Application Development",
    "label.about.studies.school.cifp.range": "09/2024 a present",
    "label.about.courses.title.full.stack": "Full Stack whith React and Node.js",
    "label.about.courses.title.angular.spring.boot": "Frontend Development with Angular 17 and Spring Boot 3 Backend",
    "label.about.courses.title.api.rest.php": "REST API with PHP and MYSQL",
    "label.about.courses.title.angular-aspnet": "Developing Applications with Angular 12 and ASP.NET Core 5",
    "label.about.courses.title.angularjs": "AngularJS Course",
    "label.about.courses.title.net": "Complete C# Programming Course in .Net",
    "label.about.courses.title.test-unit": "Angular: Unit Testing with Jasmine and Karma",
    "label.about.courses.title.marketing": "Basic Digital Marketing Concepts",
    "label.about.courses.title.unity": "2D Game Development in Unity 3D 5",
    "label.about.courses.title.angular8": "Angular 8+ with 10 complete projects",
    "label.about.courses.title.security": "Master in Computer Security. From 0 to Expert",
    "label.about.courses.title.hacking": "Ethical Hacking from Scratch",
    "label.about.courses.title.python": "Master in Python 3.x. Learn from 0 to EXPERT with Practice",
    "label.about.experiences.clarcat.range": "10/2020 to 01/2023",
    "label.about.experiences.hybrid": "Hybrid",
    "label.about.experiences.read.more": "Read more",
    "label.about.experiences.front.end.programmer": "Front-end Programmer",
    "label.about.experiences.clarcat.task": "During my employment at Clarcat, I had the privilege of being part of a significant project as a Front-End Developer. My main responsibility involved developing screens in Angular, initially working with version 7 and later migrating to Angular 13. Throughout this process, I utilized libraries such as Angular Material and also implemented custom libraries to meet specific client requirements. Additionally, I undertook the execution of unit tests using Jasmine and Karma.<br>The project was structured with an architecture comprising a front-end part developed in Angular, a small front-end back-end in .Net, and the complete back-end also in .Net. Within the front-end back-end, I worked with translations and API calls.<br>In the project, we followed Agile methodologies and worked in monthly sprints controlled by the Azure DevOps platform. Moreover, we utilized Git as a code repository, facilitating project management and version control.",
    "label.skills.data-base": "Databases",
    "label.skills.frameworks": "Frameworks",
    "label.skills.methodology": "Methodologies",
    "label.skills.programming-languages": "Programming Languages",
    "label.skills.style-library": "Style Libraries",
    "label.skills.version-control": "Version Control",
    "label.projects.title": "Projects",
    "label.projects.resume.MrRobot": "Mr. Robot is my first major project, developed as part of my end-of-cycle assignment where I achieved a high distinction. This thrilling 2D platformer with pixel art style, crafted in Unity 2019, follows the main character as they strive to reach an outlet in each level. To succeed, they gather pieces and batteries to maintain energy while encountering challenges of varying difficulty.",
    "label.projects.resume.filmatick": "FilmaticK is an ongoing project I've dedicated significant time to in support of my education. Developed in Angular and .Net, it's an ambitious Fullstack project. The platform serves as a cinematic encyclopedia where users can keep a film journal, vote on movies, and create personalized lists.",
    "label.projects.resume.puzzle": "Angular Puzzle is a jigsaw-style puzzle developed in Angular. I initially created it as part of a gift, but it turned into a personal challenge. After realizing the scarcity of similar examples online, I decided to deploy and refine it further. This uniqueness motivated me to create an elegant and beautiful website dedicated to the game.",
    "label.projects.resume.weatherTS": "WeatherTS is a dynamic and modern web application designed to deliver accurate and up-to-date weather forecasts. Developed using Angular 17, this app harnesses the power of a robust API to provide detailed weather information. Users can access the current forecast, as well as predictions for the next five days and the upcoming 24 hours, along with today’s highlighted data.",
    "label.projects.resume.shopping.cart": "Shopping Cart is a basic and functional web application, created as my first project using React and the Tailwind CSS library. This simple application allows users to add products to their shopping cart through an intuitive form. Developed as a proof of concept, Shopping Cart stands out for its clean design and responsive interface, providing a satisfactory user experience.",
    "label.contact.title": "Contact",
    "label.contact.name": "Name",
    "label.contact.email": "Email",
    "label.contact.company": "Company",
    "label.contact.message": "Message",
    "label.contact.button.send": "Send Message",
    "label.contact.success": "Message sent successfully",
    "label.contact.error": "An error occurred while sending the email",
    "label.contact.description": "Frontend Developer"
}